In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('dataset 1.csv')

In [3]:
df

     Policy no.  age     sex     bmi  charges in INR
0     PLC156898   19  female  27.900     16884.92400
1     PLC156907   18    male  33.770      1725.55230
2     PLC156916   28    male  33.000      4449.46200
3     PLC156925   33    male  22.705     21984.47061
4     PLC156934   32    male  28.880      3866.85520
...         ...  ...     ...     ...             ...
1334  PLC168904   18  female  31.920      2205.98080
1335  PLC168913   18  female  36.850      1629.83350
1336  PLC168922   21  female  25.800      2007.94500
1337  PLC168931   61  female  29.070     29141.36030
1338  PLC168935   36     NaN     NaN     32343.56000

[1339 rows x 5 columns]

In [4]:
#first 5 values
df.tail()

     Policy no.  age     sex    bmi  charges in INR
1334  PLC168904   18  female  31.92       2205.9808
1335  PLC168913   18  female  36.85       1629.8335
1336  PLC168922   21  female  25.80       2007.9450
1337  PLC168931   61  female  29.07      29141.3603
1338  PLC168935   36     NaN    NaN      32343.5600

In [5]:
#last 5 values
df.head()

  Policy no.  age     sex     bmi  charges in INR
0  PLC156898   19  female  27.900     16884.92400
1  PLC156907   18    male  33.770      1725.55230
2  PLC156916   28    male  33.000      4449.46200
3  PLC156925   33    male  22.705     21984.47061
4  PLC156934   32    male  28.880      3866.85520

In [6]:
#column names
df.columns

Index(['Policy no.', 'age', 'sex', 'bmi', 'charges in INR'], dtype='object')

In [7]:
#datatype
df.dtypes

Policy no.         object
age                 int64
sex                object
bmi               float64
charges in INR    float64
dtype: object

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1339 entries, 0 to 1338
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Policy no.      1339 non-null   object
 1   age             1339 non-null   int64
 2   sex             1338 non-null   object
 3   bmi             1338 non-null   float64
 4   charges in INR  1339 non-null   float64
dtypes: float64(2), int64(1), object(2)
memory usage: 52.4+ KB

###  Dropping any row(axis=0) and column(axis=1)

In [9]:
df.drop('Policy no.', axis=1)
df.drop(2,axis=0)

     Policy no.  age     sex     bmi  charges in INR
0     PLC156898   19  female  27.900     16884.92400
1     PLC156907   18    male  33.770      1725.55230
3     PLC156925   33    male  22.705     21984.47061
4     PLC156934   32    male  28.880      3866.85520
5     PLC156943   31  female  25.740      3756.62160
...         ...  ...     ...     ...             ...
1334  PLC168904   18  female  31.920      2205.98080
1335  PLC168913   18  female  36.850      1629.83350
1336  PLC168922   21  female  25.800      2007.94500
1337  PLC168931   61  female  29.070     29141.36030
1338  PLC168935   36     NaN     NaN     32343.56000

[1338 rows x 5 columns]

In [10]:
df.head()

  Policy no.  age     sex     bmi  charges in INR
0  PLC156898   19  female  27.900     16884.92400
1  PLC156907   18    male  33.770      1725.55230
2  PLC156916   28    male  33.000      4449.46200
3  PLC156925   33    male  22.705     21984.47061
4  PLC156934   32    male  28.880      3866.85520

In [11]:
df1=df.drop('Policy no.', axis=1 )  #temporary dropping
df1

      age     sex     bmi  charges in INR
0      19  female  27.900     16884.92400
1      18    male  33.770      1725.55230
2      28    male  33.000      4449.46200
3      33    male  22.705     21984.47061
4      32    male  28.880      3866.85520
...   ...     ...     ...             ...
1334   18  female  31.920      2205.98080
1335   18  female  36.850      1629.83350
1336   21  female  25.800      2007.94500
1337   61  female  29.070     29141.36030
1338   36     NaN     NaN     32343.56000

[1339 rows x 4 columns]

In [12]:
df.drop('Policy no.', axis=1 , inplace = True)   #use inplace for permanent dropping

In [13]:
df.head()

   age     sex     bmi  charges in INR
0   19  female  27.900     16884.92400
1   18    male  33.770      1725.55230
2   28    male  33.000      4449.46200
3   33    male  22.705     21984.47061
4   32    male  28.880      3866.85520

In [14]:
df1

      age     sex     bmi  charges in INR
0      19  female  27.900     16884.92400
1      18    male  33.770      1725.55230
2      28    male  33.000      4449.46200
3      33    male  22.705     21984.47061
4      32    male  28.880      3866.85520
...   ...     ...     ...             ...
1334   18  female  31.920      2205.98080
1335   18  female  36.850      1629.83350
1336   21  female  25.800      2007.94500
1337   61  female  29.070     29141.36030
1338   36     NaN     NaN     32343.56000

[1339 rows x 4 columns]

##  Checking Null values

In [15]:
df.isnull()

        age    sex    bmi  charges in INR
0     False  False  False           False
1     False  False  False           False
2     False  False  False           False
3     False  False  False           False
4     False  False  False           False
...     ...    ...    ...             ...
1334  False  False  False           False
1335  False  False  False           False
1336  False  False  False           False
1337  False  False  False           False
1338  False   True   True           False

[1339 rows x 4 columns]

In [16]:
df.isnull().sum()

age               0
sex               1
bmi               1
charges in INR    0
dtype: int64

In [17]:
df.isna()

        age    sex    bmi  charges in INR
0     False  False  False           False
1     False  False  False           False
2     False  False  False           False
3     False  False  False           False
4     False  False  False           False
...     ...    ...    ...             ...
1334  False  False  False           False
1335  False  False  False           False
1336  False  False  False           False
1337  False  False  False           False
1338  False   True   True           False

[1339 rows x 4 columns]

In [18]:
df.isna().sum()

age               0
sex               1
bmi               1
charges in INR    0
dtype: int64

## Finding unique values for different columns in DataFrame

In [19]:
df['sex'].unique()

array(['female', 'male', nan], dtype=object)

In [20]:
df['sex'].count()

1338

In [21]:
df['sex'].value_counts()

male      676
female    662
Name: sex, dtype: int64

In [22]:
#difference between null and na
#This is because pandas' DataFrames are based on R's DataFrames. In R na and null are two separate things. 
#However, in python, pandas is built on top of numpy, which has neither na nor null values. 
#Instead numpy has NaN values (which stands for "Not a Number"). Consequently, pandas also uses NaN values.
#To detect NaN values numpy uses np.isnan().
#The NaN values are inherited from the fact that pandas is built on top of numpy, 
#while the two functions' names originate from R's DataFrames, whose structure and functionality pandas tried to mimic

In [23]:
df['age'].value_counts()

18    69
19    68
50    29
51    29
47    29
46    29
45    29
20    29
48    29
52    29
22    28
49    28
54    28
53    28
21    28
26    28
24    28
23    28
25    28
28    28
27    28
43    27
29    27
31    27
40    27
44    27
42    27
41    27
30    27
36    26
57    26
33    26
32    26
34    26
55    26
56    26
37    25
59    25
58    25
38    25
35    25
39    25
61    23
60    23
63    23
62    23
64    22
Name: age, dtype: int64

In [24]:
df.columns

Index(['age', 'sex', 'bmi', 'charges in INR'], dtype='object')

In [33]:
for i in df.columns:
    print(i)

age
sex
bmi
charges in INR

In [26]:
df['age'].dtype

dtype('int64')

In [27]:
df['sex'].dtype

dtype('O')

In [28]:
df['bmi'].dtype

dtype('float64')

In [29]:
df['charges in INR'].dtype

dtype('float64')

In [37]:
for i in df.columns:
    print(df[i].dtype)

int64
object
float64
float64

In [31]:
for col in df.columns:
    if df[col].dtype == 'object':
        print(df[col].dtype)

object

In [39]:
for col in df.drop('sex',axis=1).columns:
    if df[col].dtype == 'object':
        print(df[col].dtype)
#We are getting no output as there is only 1 categorical variable i.e sex and it is getting dropped,
#policy no was dropped earlier